{
    "blogs":[
        {
            "id": "Starting the Journey",
            "date": "2/26/2018",
            "entry": "My journey into coding truly began two weeks ago. I came in the classroom not knowing what to expect, but knowing that I plan to finish. So far github branches have been a pain in the YOU_KNOW_WHAT! I have no error with it on a normal occasion github. I must admit after doing the repo assignment I  really had no choice but to get the understanding(insert emoji of yellow girl and the shoulder shrug). Although this journey has just began I feel that I am learning the things needed to have a successful career. For those who dont know about github...Become a Developer and you shall find out. Just kidding, let me explain.Github, starts with a understanding of Git, which is a open source version control where developers create i.e. apps by making several changes before releasing as an active app. The version control allows for storing updates. It makes public your code allowing other members to contribute to your work as well. Now that we know what github is let me share a few cool things you can do. At the start of each project you create a repository. This is also known as a repo and its where all files for your one project can be stored. This makes your work easily accessible for you and others if sharing. You also have the ability to contribute to other projects. You simply request to contribute and based off you repo the owner can allow you to make changes in their projects. It's also a smart way to connect with fellow developers. There is a follow feature that allows for additional communication. You are able to create a profile."
        },
        {
            "id": "Eyes Wide Open...",
            "date": "3/5/2018",
            "entry": "Let's just say JavaScrpit got REAL this week. I have a Love/Hate relationship with it currently. We learn one thing thinking life is good until we get the daily challenges and life throws us handgrenades. This is how it's been this week. I was told this would happen so Im not completely shedding tears. Now, that Im done with the emotions lets get to the meat of it all. I absolutely struggled with Arrays. I understand the concept but once the for loop comes into play I felt like a IDIOT! I honestly had no clue how to take what I know to be true and make sense and place in a for loop. I was fortunate enough to have the time to sit down with an instructor and talk it out. Im hoping to gain a better understanding in the next few days by doing more challenges. All is Well!!"
        },
        {
            "id":"It's Getting Interesting!",
            "date": "3/12/2018",
            "entry": "I'm feeling much better this week. I feel that I'm getting a better understanding of what is going on. Now its just me thinking more logically in my for loops. This is truly my only problem. I will look a bit more at functions and for loops to get a better understanding."
        },
        {
            "id": "Moving from VAR to LET and CONST",
            "date": "3/27/2018",
            "entry": "I definitely hate the feeling of uncertainty. When introduced at first glance you wonder why we didnt learn this way in the beginning. I do understand why we learn 'Vanilla' JavaScript, but it still sucks. Anywho, I can grasps the meaning when creating a for loop but I still don't grasp all the elements needed toadd in the for loop to produce the answer I want. I'm working on this concept one day at a time. Once I discover I need to add a 'forEach' or a 'join()/split()' I feel like I just need to learn more rules for things to work in the ways the should. In our last group project I chose to work on the page needing loops because I wanted to better my understanding. I feel like Im taking the neccessary steps needed to better my understanding but sometimes I feel lost."
        },
        {
            "id":"New Found Appreciation",
            "date":"4/4/2018",
            "entry": "This week we learned about the JSON. I feel the more we learn the more compact the inforation gets...BUT the functions grow. More to write equats to more functionality learned. I struggled deeply with the hover event listener this week. I'm still working on but there is hope now that I have a full scope of what Im looking for. There has definitely been some challenges this week. Working full time and school is hard, yet rewarding. I just keep looking towards the end. I dont know what the future holds but I do know i'll be coding to the end."
        },
        {
            "id":"Functions within a Function",
            "date": "4/8/2018",
            "entry": "Cool method no doubt...Am I there yet? I'm gettingt there. This was easier than the previous project because I had a good team who spent hours talking over functions to get a beeter understanding. This Treehouse assignment made us work with json, objects in arrays, functions in functions, and mutiple XHR requests. To say the least it was challenging. WAlking through it with my group really helped me. I'm carefully working on my weaknesses. I thought it was functionality but it may be the hover button...SMH!!"
        },
        {
            "id":"Browserify",
            "date": "4/14/2018",
            "entry": "So we are using grunt this week. Its both wonderful and annoying at the same time. I struggled where te particular functions and XHR request go. Overall once you get past that it a good additions. It makes the code easier to read and easier to find. I'm starting to llike it but Im sure this will change next week."
        },
        {
            "id":"Task Runner",
            "date": "4/25/2018",
            "entry": "Just out here trying to get my javascript files in order. Its been challenging knowing where what goes where. After starting the group project I feel I got a sec to examine each file and know when to do what."
        },
        {
          "id": "Chatty-Gen",
          "date": "4/30/2018",
          "entry": "Per this group we are working with individuals who are of the same skill level. This was very interesting. I felt we worked well together. I also felt it gave me a chance to ask questions and get a better understanding. In class we have many that will ask confusing questions that go ahead of the lessons we are currently learning. Some questions cause confusion if the individual doesn't know what to ask in the first place. I learned patience in this group. I found out that I'm use to the corporate world. In the corporate world they tell you to do someting and you just find the answer regardless to what you know. I'm not familar with waiting for someone to catch up. My mentality since working in a corporate setting is you listen once take as many notes as possible and get it done. If you do need help you can definitely ask but for the most part there is no 'Hand Holding'."
        },
        {
          "id": "jQuery",
          "date": "5/4/2018",
          "entry": "To make things easier month to month. Im on to 'THEM'! We learn vanilla and we go down the rabbit hole than to soften the blow they give us a beacon of light at the end of the tunnel. I'll take that light any day of the week. So far so good. Just learning where to add these buttons."
        },
        {
          "id": "Promises",
          "date": "5/24/2018",
          "entry": "In learning promises you really have to have a true understanding te different ways Promise functions can be created. This does away with XHR calls, which are called in the seperated Promises. I had to do a bit more reasearching since I did not understand 100%. "
        },
        {
          "id": "API",
          "date": "5/29/2018",
          "entry": "I have enjoyed the concept of the API! I't has added a  new layer for recieving information and created a more secure enviornment. "
        }
    ]
}